---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraint
source: html/94b2debc-c7f2-6067-5df4-878c34fb0a03.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraint Property

Highlighted constraints cause a circular chain of references.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyConstraint { get; }
```